In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('City_Zri_AllHomesPlusMultifamily.csv', encoding="ISO-8859-1")

In [3]:
df.sample(5)

,RegionID,RegionName,State,Metro,CountyName,SizeRank,2010-11,2010-12,2011-01,2011-02,...,2018-04,2018-05,2018-06,2018-07,2018-08,2018-09,2018-10,2018-11,2018-12,2019-01
5425,53703,Old Lyme,CT,Norwich-New London,New London County,5426,1581.0,1575.0,1586.0,1598.0,...,1621,1632,1634,1626,1616,1606,1603,1610,1631,1656
7235,10212,Augusta,WI,Eau Claire,Eau Claire County,7236,NaN,NaN,NaN,NaN,...,1108,1079,1052,1023,1006,1000,1003,1027,1060,1090
4201,25599,Lincoln Park,NJ,New York-Newark-Jersey City,Morris County,4202,2511.0,2371.0,2292.0,2246.0,...,2415,2431,2440,2444,2446,2447,2446,2432,2402,2363
11774,55106,West Fairview,PA,Harrisburg-Carlisle,Cumberland County,11775,976.0,976.0,974.0,978.0,...,988,989,988,986,984,983,985,995,1015,1039
7515,53440,Mount Pleasant,PA,Pittsburgh,Westmoreland County,7516,925.0,932.0,927.0,920.0,...,857,853,850,849,848,847,846,837,828,821

In [4]:
df_Hoboken = df[df['RegionName'] == 'Hoboken']

In [5]:
df_Hoboken = df_Hoboken.iloc[:, 6:]

In [6]:
df_Hoboken = df_Hoboken.T

In [7]:
df_Hoboken = df_Hoboken.reset_index()

In [8]:
df_Hoboken = df_Hoboken.rename(columns={'index':'date', 903:'price'})

In [9]:
df_Hoboken.head()

      date   price
0  2010-11  2534.0
1  2010-12  2553.0
2  2011-01  2553.0
3  2011-02  2539.0
4  2011-03  2525.0

In [10]:
df_UnionCity = df[(df['RegionName'] == 'Union City') & (df['State'] == 'NJ')]

In [11]:
df_UnionCity = df_UnionCity.iloc[:, 6:]

In [12]:
df_UnionCity = df_UnionCity.T

In [13]:
df_UnionCity = df_UnionCity.reset_index()

In [14]:
df_UnionCity = df_UnionCity.rename(columns={'index':'date', 650:'price'})

In [15]:
df_UnionCity.head()

      date   price
0  2010-11  1864.0
1  2010-12  1841.0
2  2011-01  1830.0
3  2011-02  1827.0
4  2011-03  1828.0

In [16]:
df_JerseyCity = df[df['RegionName'] == 'Jersey City']

In [17]:
df_JerseyCity = df_JerseyCity.iloc[:, 6:]

In [18]:
df_JerseyCity = df_JerseyCity.T

In [19]:
df_JerseyCity = df_JerseyCity.reset_index()

In [20]:
df_JerseyCity = df_JerseyCity.rename(columns={'index':'date', 75:'price'})

In [21]:
df_JerseyCity.head()

      date   price
0  2010-11  1787.0
1  2010-12  1812.0
2  2011-01  1822.0
3  2011-02  1827.0
4  2011-03  1846.0

In [22]:
df_Hoboken.to_csv('Hoboken_price.csv', index=False)

In [23]:
df_UnionCity.to_csv('UnionCity_price.csv', index=False)

In [24]:
df_JerseyCity.to_csv('JerseyCity_price.csv', index=False)